In [1]:
import pandas as pd

data = {'city':['Bogotá', 'Bogotá', 'Cali', 'Cali', 'Medellín', 'Medellín'],
        'salesman':['Juan', 'Mary', 'Joy', 'Alex', 'Ana', 'Peter'],
        'Sales':[100, 200, 300, 400, 120, 300]}

df = pd.DataFrame(data)
df

   Sales      city salesman
0    100    Bogotá     Juan
1    200    Bogotá     Mary
2    300      Cali      Joy
3    400      Cali     Alex
4    120  Medellín      Ana
5    300  Medellín    Peter

In [3]:
# Using group by

byCity = df.groupby('city')
byCity.sum()

          Sales
city
Bogotá      300
Cali        700
Medellín    420

In [4]:
# Selecting a group using sum
df.groupby('city').sum().loc['Bogotá']

Sales    300
Name: Bogotá, dtype: int64

In [5]:
# Using count
df.groupby('city').count()

          Sales  salesman
city
Bogotá        2         2
Cali          2         2
Medellín      2         2

In [6]:
# Using describe

df.groupby('city').describe()#.transpose()

         Sales
         count   mean         std    min    25%    50%    75%    max
city
Bogotá     2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0
Cali       2.0  350.0   70.710678  300.0  325.0  350.0  375.0  400.0
Medellín   2.0  210.0  127.279221  120.0  165.0  210.0  255.0  300.0